{
  "classes": {
    "grade6Social": {
      "name": "Grade 6 Social Studies",
      "subject": "Social Studies",
      "strands": {
        "geography": {
          "name": "Geography",
          "outcomes": {
            "locate_atlantic_canada": {
              "title": "Locate Atlantic Canada in relation to other regions",
              "templates": {
                "2": "TODO: Level 2 template for locating Atlantic Canada in relation to other regions.",
                "3": "TODO: Level 3 template for locating Atlantic Canada in relation to other regions.",
                "3plus": "TODO: Level 3+ template for locating Atlantic Canada in relation to other regions."
              }
            },
            "investigate_physical_features_weather": {
              "title": "Investigate physical features and weather patterns of Atlantic Canada",
              "templates": {
                "2": "TODO: Level 2 template for investigating physical features and weather patterns of Atlantic Canada.",
                "3": "TODO: Level 3 template for investigating physical features and weather patterns of Atlantic Canada.",
                "3plus": "TODO: Level 3+ template for investigating physical features and weather patterns of Atlantic Canada."
              }
            },
            "examine_cultures_global_connections": {
              "title": "Examine contemporary cultures and global connections",
              "templates": {
                "2": "TODO: Level 2 template for examining contemporary cultures and global connections.",
                "3": "TODO: Level 3 template for examining contemporary cultures and global connections.",
                "3plus": "TODO: Level 3+ template for examining contemporary cultures and global connections."
              }
            },
            "investigate_cultural_ethnic_linguistic_groups": {
              "title": "Investigate cultural, ethnic, and linguistic groups in Atlantic Canada",
              "templates": {
                "2": "TODO: Level 2 template for investigating cultural, ethnic, and linguistic groups in Atlantic Canada.",
                "3": "TODO: Level 3 template for investigating cultural, ethnic, and linguistic groups in Atlantic Canada.",
                "3plus": "TODO: Level 3+ template for investigating cultural, ethnic, and linguistic groups in Atlantic Canada."
              }
            }
          }
        },
        "civics": {
          "name": "Civics",
          "outcomes": {
            "explain_global_communities": {
              "title": "Explain how Atlantic Canadians are part of global communities",
              "templates": {
                "2": "TODO: Level 2 template for explaining how Atlantic Canadians are part of global communities.",
                "3": "TODO: Level 3 template for explaining how Atlantic Canadians are part of global communities.",
                "3plus": "TODO: Level 3+ template for explaining how Atlantic Canadians are part of global communities."
              }
            },
            "explain_influence_political_decisions": {
              "title": "Explain how Atlantic Canadians influence political decisions",
              "templates": {
                "2": "TODO: Level 2 template for explaining how Atlantic Canadians influence political decisions.",
                "3": "TODO: Level 3 template for explaining how Atlantic Canadians influence political decisions.",
                "3plus": "TODO: Level 3+ template for explaining how Atlantic Canadians influence political decisions."
              }
            }
          }
        },
        "economics": {
          "name": "Economics",
          "outcomes": {
            "discuss_role_economics": {
              "title": "Discuss the role of economics in Atlantic Canadian society",
              "templates": {
                "2": "TODO: Level 2 template for discussing the role of economics in Atlantic Canadian society.",
                "3": "TODO: Level 3 template for discussing the role of economics in Atlantic Canadian society.",
                "3plus": "TODO: Level 3+ template for discussing the role of economics in Atlantic Canadian society."
              }
            },
            "research_trade_global_linkages": {
              "title": "Research trade and global economic linkages",
              "templates": {
                "2": "TODO: Level 2 template for researching trade and global economic linkages.",
                "3": "TODO: Level 3 template for researching trade and global economic linkages.",
                "3plus": "TODO: Level 3+ template for researching trade and global economic linkages."
              }
            },
            "analyze_economic_patterns_issues": {
              "title": "Analyze local, regional, and global economic patterns and related issues",
              "templates": {
                "2": "TODO: Level 2 template for analyzing economic patterns and related issues.",
                "3": "TODO: Level 3 template for analyzing economic patterns and related issues.",
                "3plus": "TODO: Level 3+ template for analyzing economic patterns and related issues."
              }
            }
          }
        },
        "history": {
          "name": "History",
          "outcomes": {
            "investigate_cross_cultural_history": {
              "title": "Investigate the history of cross-cultural understanding in the Atlantic region",
              "templates": {
                "2": "TODO: Level 2 template for investigating the history of cross-cultural understanding in the Atlantic region.",
                "3": "TODO: Level 3 template for investigating the history of cross-cultural understanding in the Atlantic region.",
                "3plus": "TODO: Level 3+ template for investigating the history of cross-cultural understanding in the Atlantic region."
              }
            }
          }
        },
        "wabanaki_studies": {
          "name": "Wabanaki Studies",
          "outcomes": {
            "explore_reconciliation_resiliency": {
              "title": "Explore reconciliation and resiliency in Wabanaki territories",
              "templates": {
                "2": "TODO: Level 2 template for exploring reconciliation and resiliency in Wabanaki territories.",
                "3": "TODO: Level 3 template for exploring reconciliation and resiliency in Wabanaki territories.",
                "3plus": "TODO: Level 3+ template for exploring reconciliation and resiliency in Wabanaki territories."
              }
            }
          }
        }
      }
    }
  },
  "endingOptions": [
    "They have strong foundational skills and could excel with increased focus.",
    "They consistently engage with lessons and contribute to class discussions."
  ],
  "currentClass": "grade6Social"
}
